Constraints in sketches of highlighted elements cause a circular chain of references.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CircularDependencySketch { get; }
  Visual Basic
Public Shared ReadOnly Property CircularDependencySketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CircularDependencySketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RegenFailures Class
  Autodesk.Revit.DB Namespace